/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Operáciu sa nepodarilo dokončiť";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Vyskytla sa neznáma chyba (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Nie je možné dokončiť akciu";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Skúste to neskôr.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Nie je možné nahrávať";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Skúste znovu nahrávať.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Nie je možné nahrávať";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Zastavte ostatné akcie pomocou %@ a skúste to znovu."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Nie je možné nahrávať";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Skúste znovu nahrávať.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Nahrávanie zastavené";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Skúste znovu nahrávať.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operácia zastavená";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Nemáte dostatok miesta pre pokračovanie zapisovania súboru. Uvoľnite miesto vymazaním videí alebo fotiek.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Nahrávanie zastavené";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Skúste znovu nahrávať.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Nahrávanie zastavené";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Skúste znovu nahrávať.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Nahrávanie zastavené";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Pre túto nahrávku bola dosiahnutá maximálna povolená dĺžka."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Nahrávanie zastavené";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Pre túto nahrávku bola dosiahnutá maximálna povolená veľkosť súboru."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Nahrávanie zastavené";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Zastavte ostatné akcie pomocou nahrávacieho zariadenia a skúste to znovu.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Nahrávanie zastavené";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Pre túto nahrávku bola dosiahnutá maximálna povolená dĺžka."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Nie je možné nahrávať";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Skúste znovu nahrávať.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Nie je možné použiť %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Zastavte ostatné akcie pomocou %@ a skúste to znovu."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Nie je možné použiť %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Zastavte ostatné akcie pomocou %@ a skúste to znovu."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Nahrávanie zastavené";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Zastavte ostatné akcie pomocou nahrávacieho zariadenia a skúste to znovu.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "Osvetlenie sa nepodarilo zapnúť.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Skúste zapnúť osvetlenie s nižšou intenzitou.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Nie je možné dokončiť akciu";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Skúste to neskôr.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Nie je možné dokončiť export";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Skúste znovu exportovať.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Nie je možné dekódovať";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Dáta média nie je možné dekódovať. Zrejme sú poškodené.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Tento formát média nie je podporovaný.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Nie je možné uložiť";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Skúste znovu uložiť.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Nepodarilo sa zapísať výstupný súbor";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Zmeňte koncovku výstupu a skúste to znovu.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Médium nie je možné použiť.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Médium nie je možné použiť.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Médium nie je možné použiť.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Médium nie je možné použiť.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Tento formát média nie je podporovaný.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Médium je zrejme poškodené.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Nedá sa spraviť fotka";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Skúste znovu odfotiť.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operácia zastavená";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Operácia nie je podporovaná pre chránený obsah."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Tento obsah nie je autorizovaný."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Táto aplikácia nie je autorizovaná na prehrávanie súboru."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Médium nie je možné použiť.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Nie je možné dekódovať";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Dekodér vyžadovaný týmto médiom sa nenašiel.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Nie je možné kódovať";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Kodér vyžadovaný týmto médiom sa nenašiel.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Nie je možné dekódovať";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Dekodér vyžadovaný týmto médiom je zaneprázdnený.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Zastavte ostatné akcie, ktoré dekódujú médiá a skúste to znovu.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Nie je možné kódovať";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Kodér vyžadovaný týmto médiom je zaneprázdnený.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Zastavte ostatné akcie, ktoré kódujú médiá a skúste to znovu.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Nie je možné použiť %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Aplikácia spustená v popredí zrejme nebude môcť použiť zariadenie (%@)."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operácia zastavená";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Operácia nie je podporovaná pre tieto médiá.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operácia zastavená";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Video sa na základe zvolených inštrukcií nepodarilo zostaviť.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Médium nie je možné použiť.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operácia zastavená";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Súbor cache na cieľovej URL adrese nie je možné použiť.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Operácia zastavená";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "Súbor má neplatný kontrolný súčet.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Operácia prerušená";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Zastavte ostatné operácie a skúste to znovu.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Nie je možné otvoriť";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Médium nie je možné použiť na tomto zariadení.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Operácia zastavená";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "Médium je zrejme poškodené.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Operácia zastavená";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "Server nie je správne nakonfigurovaný.";
